[info]
drivername=DTSPipeline150
symbolfile=dtsperf.h

[languages]
009=English
804=Chinese (PRC)

[objects]
PRFOBJ_PIPELINE_START_009_NAME=SQLServer:SSIS Pipeline 15.0

PRFOBJ_PIPELINE_START_804_NAME=SQLServer:SSIS Pipeline 15.0

[text]
PRFOBJ_PIPELINE_START_009_NAME=SQLServer:SSIS Pipeline 15.0
PRFOBJ_PIPELINE_START_009_HELP=The SSIS Pipeline object includes those counters related to the execution of the pipeline.

PIPELINE_CTR_ROWSREAD_009_NAME=Rows read
PIPELINE_CTR_ROWSREAD_009_HELP=The number of rows read from all data sources in total.

PIPELINE_CTR_ROWSWRITTEN_009_NAME=Rows written
PIPELINE_CTR_ROWSWRITTEN_009_HELP=The number of rows written to all data destinations in total.

PIPELINE_CTR_BUFFERSINUSE_009_NAME=Buffers in use
PIPELINE_CTR_BUFFERSINUSE_009_HELP=The number of pipeline buffers in use throughout the pipeline.

PIPELINE_CTR_BUFFERMEMORY_009_NAME=Buffer memory
PIPELINE_CTR_BUFFERMEMORY_009_HELP=The amount of memory allocated to buffers in the pipeline.

PIPELINE_CTR_PRIVATEBUFFERSINUSE_009_NAME=Private buffers in use
PIPELINE_CTR_PRIVATEBUFFERSINUSE_009_HELP=The number of private transformation buffers in use throughout the pipeline.

PIPELINE_CTR_PRIVATEBUFFERMEMORY_009_NAME=Private buffer memory
PIPELINE_CTR_PRIVATEBUFFERMEMORY_009_HELP=The amount of memory allocated to private transformation buffers.

PIPELINE_CTR_FLATBUFFERSINUSE_009_NAME=Flat buffers in use
PIPELINE_CTR_FLATBUFFERSINUSE_009_HELP=The number of flat memory buffers in use throughout the pipeline.

PIPELINE_CTR_FLATBUFFERMEMORY_009_NAME=Flat buffer memory
PIPELINE_CTR_FLATBUFFERMEMORY_009_HELP=The amount of memory allocated to flat memory buffers.

PIPELINE_CTR_SWAPPEDBUFFERS_009_NAME=Buffers spooled
PIPELINE_CTR_SWAPPEDBUFFERS_009_HELP=The number of buffers spooled to disk.

PIPELINE_CTR_BLOBBYTESREAD_009_NAME=BLOB bytes read
PIPELINE_CTR_BLOBBYTESREAD_009_HELP=The number of BLOB bytes read from all data sources in total.

PIPELINE_CTR_BLOBBYTESWRITTEN_009_NAME=BLOB bytes written
PIPELINE_CTR_BLOBBYTESWRITTEN_009_HELP=The number of BLOB bytes written to all data sources in total.

PIPELINE_CTR_BLOBFILESINUSE_009_NAME=BLOB files in use
PIPELINE_CTR_BLOBFILESINUSE_009_HELP=The number of BLOB spooling files in use throughout the pipeline.


PRFOBJ_PIPELINE_START_804_NAME=SQLServer:SSIS Pipeline 15.0
PRFOBJ_PIPELINE_START_804_HELP=SSIS 管道对象包括与管道执行有关的那些计数器。

PIPELINE_CTR_ROWSREAD_804_NAME=Rows read
PIPELINE_CTR_ROWSREAD_804_HELP=从所有数据源读取的总行数。

PIPELINE_CTR_ROWSWRITTEN_804_NAME=Rows written
PIPELINE_CTR_ROWSWRITTEN_804_HELP=写入所有数据目标中的总行数。

PIPELINE_CTR_BUFFERSINUSE_804_NAME=Buffers in use
PIPELINE_CTR_BUFFERSINUSE_804_HELP=在整个管道中使用的管道缓冲区数。

PIPELINE_CTR_BUFFERMEMORY_804_NAME=Buffer memory
PIPELINE_CTR_BUFFERMEMORY_804_HELP=分配给管道中的缓冲区的内存量。

PIPELINE_CTR_PRIVATEBUFFERSINUSE_804_NAME=Private buffers in use
PIPELINE_CTR_PRIVATEBUFFERSINUSE_804_HELP=在整个管道中使用的专用转换缓冲区数。

PIPELINE_CTR_PRIVATEBUFFERMEMORY_804_NAME=Private buffer memory
PIPELINE_CTR_PRIVATEBUFFERMEMORY_804_HELP=分配给专用转换缓冲区的内存量。

PIPELINE_CTR_FLATBUFFERSINUSE_804_NAME=Flat buffers in use
PIPELINE_CTR_FLATBUFFERSINUSE_804_HELP=在整个管道中使用的平面内存缓冲区数。

PIPELINE_CTR_FLATBUFFERMEMORY_804_NAME=Flat buffer memory
PIPELINE_CTR_FLATBUFFERMEMORY_804_HELP=分配给平面内存缓冲区的内存量。

PIPELINE_CTR_SWAPPEDBUFFERS_804_NAME=Buffers spooled
PIPELINE_CTR_SWAPPEDBUFFERS_804_HELP=假脱机保存到磁盘的缓冲区数。

PIPELINE_CTR_BLOBBYTESREAD_804_NAME=BLOB bytes read
PIPELINE_CTR_BLOBBYTESREAD_804_HELP=从所有数据源读取的 BLOB 字节总数。

PIPELINE_CTR_BLOBBYTESWRITTEN_804_NAME=BLOB bytes written
PIPELINE_CTR_BLOBBYTESWRITTEN_804_HELP=写入所有数据源中的 BLOB 字节总数。

PIPELINE_CTR_BLOBFILESINUSE_804_NAME=BLOB files in use
PIPELINE_CTR_BLOBFILESINUSE_804_HELP=在整个管道中使用的 BLOB 假脱机文件数。

